#pragma once
#include <any>

// ********************************************************************************
/// <summary>
/// アクションベースクラス
/// </summary>
// ********************************************************************************
class ActionBase {
public:

    // ********************************************************************************
    /// <summary>
    /// アクション
    /// </summary>
    /// <param name="any">引数</param>
    /// <returns>true : 成功, false : 失敗</returns>
    /// <created>いのうえ,2021/03/18</created>
    /// <changed>いのうえ,2021/03/18</changed>
    // ********************************************************************************
    virtual bool Action(std::any any = nullptr) = 0;
};

