#pragma once
#include "MofImGui/MofImGui.h"

// ********************************************************************************
/// <summary>
/// デバッグ用ImGui描画クラス
/// </summary>
// ********************************************************************************
class DebugGui {
private:
    DebugGui(void) = delete;
    ~DebugGui(void) = delete;

public:

    // ********************************************************************************
    /// <summary>
    /// IsItem系情報
    /// </summary>
    /// <created>いのうえ,2021/03/17</created>
    /// <changed>いのうえ,2021/03/17</changed>
    // ********************************************************************************
    static void ShowIsItemInfoWindow(void);

    // ********************************************************************************
    /// <summary>
    /// マウス情報
    /// </summary>
    /// <created>いのうえ,2021/03/17</created>
    /// <changed>いのうえ,2021/03/17</changed>
    // ********************************************************************************
    static void ShowMouseInfoWindow(void);

    // ********************************************************************************
    /// <summary>
    /// Rect情報
    /// </summary>
    /// <created>いのうえ,2021/03/17</created>
    /// <changed>いのうえ,2021/03/17</changed>
    // ********************************************************************************
    static void ShowRectInfoWindow(void);
};

