#pragma once
#include "ActionBase.h"

// ********************************************************************************
/// <summary>
/// 
/// </summary>
// ********************************************************************************
class MeshLoadDialog : public ActionBase {
public:
    // ********************************************************************************
    /// <summary>
    /// 
    /// </summary>
    /// <param name="any"></param>
    /// <returns></returns>
    /// <created>‚¢‚Ì‚¤‚¦,2021/03/18</created>
    /// <changed>‚¢‚Ì‚¤‚¦,2021/03/18</changed>
    // ********************************************************************************
    virtual bool Action(std::any any) override;
};

