#pragma once
#include "Mof.h"
#include "MofImGui/MofImGui.h"
#include "Define.h"

// ********************************************************************************
/// <summary>
/// オブジェクトを管理するウィンドウ
/// </summary>
// ********************************************************************************
class ObjectWindow {
private:

    //! オブジェクトリスト
    std::vector<ObjectData> _object_list;
    //! 選択中の番号      
    int                     _object_list_current   { 0 };
    //! 選択中のアイテム      
    ObjectData*             _object_select_item    { nullptr };
    //! オブジェクトのトランスフォーム情報入力方法
    bool                    _object_data_input_mode{ true };

    // ********************************************************************************
    /// <summary>
    /// オブジェクトリストの表示
    /// </summary>
    /// <created>いのうえ,2021/03/20</created>
    /// <changed>いのうえ,2021/03/20</changed>
    // ********************************************************************************
    void ShowObjectList(void);

    // ********************************************************************************
    /// <summary>
    /// 選択中のオブジェクトデータ情報を表示
    /// </summary>
    /// <created>いのうえ,2021/03/20</created>
    /// <changed>いのうえ,2021/03/20</changed>
    // ********************************************************************************
    void ShowObjectInfo(void);

    // ********************************************************************************
    /// <summary>
    /// データの破棄
    /// </summary>
    /// <created>いのうえ,2021/03/20</created>
    /// <changed>いのうえ,2021/03/20</changed>
    // ********************************************************************************
    void Remove(void);

public:

    // ********************************************************************************
    /// <summary>
    /// コンストラクタ
    /// </summary>
    /// <created>いのうえ,2021/03/20</created>
    /// <changed>いのうえ,2021/03/20</changed>
    // ********************************************************************************
    ObjectWindow(void);
    
    // ********************************************************************************
    /// <summary>
    /// デストラクタ
    /// </summary>
    /// <created>いのうえ,2021/03/20</created>
    /// <changed>いのうえ,2021/03/20</changed>
    // ********************************************************************************
    ~ObjectWindow(void);

    // ********************************************************************************
    /// <summary>
    /// ウィンドウの表示
    /// </summary>
    /// <created>いのうえ,2021/03/20</created>
    /// <changed>いのうえ,2021/03/20</changed>
    // ********************************************************************************
    void Show(void);

    // ********************************************************************************
    /// <summary>
    /// オブジェクトデータの追加
    /// </summary>
    /// <param name="data">追加するデータ</param>
    /// <created>いのうえ,2021/03/20</created>
    /// <changed>いのうえ,2021/03/20</changed>
    // ********************************************************************************
    void Add(ObjectData& data);

    // ********************************************************************************
    /// <summary>
    /// 現在選択中のデータを取得する
    /// </summary>
    /// <returns>現在選択中のデータポインタ</returns>
    /// <created>いのうえ,2021/03/20</created>
    /// <changed>いのうえ,2021/03/20</changed>
    // ********************************************************************************
    ObjectData* GetSelectObjectData(void);

    // ********************************************************************************
    /// <summary>
    /// オブジェクトリストの取得
    /// </summary>
    /// <returns>オブジェクトリスト</returns>
    /// <created>いのうえ,2021/03/20</created>
    /// <changed>いのうえ,2021/03/20</changed>
    // ********************************************************************************
    const std::vector<ObjectData>& GetObjectList(void) const;
};

