#pragma once
#include "MofImGui/MofImGui.h"

// ********************************************************************************
/// <summary>
/// メニュバーの下のツールメニュー
/// </summary>
// ********************************************************************************
class ToolMenu {
private:
    ToolMenu(void)  = delete;
    ~ToolMenu(void) = delete;

public:
    // ********************************************************************************
    /// <summary>
    /// 
    /// </summary>
    /// <created>いのうえ,2021/03/20</created>
    /// <changed>いのうえ,2021/03/20</changed>
    // ********************************************************************************
    static void Show(void);
};

